
#Область  СлужебныеПроцедурыИФункции

Процедура ОтправкаУведомлений() Экспорт  
	
	ВыборкаДетальныеЗаписи = Справочники.ВКМ_УведомленияТелеграмБоту.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СообщениеДляОтправки = ВыборкаДетальныеЗаписи.ПолучитьОбъект();
		
		Токен = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить(); 
		ChatID = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить(); 
		
		Соединение = Новый HTTPСоединение("api.Telegram.Org", 443, Истина);
		ПутьКРесурсу = "/bot" + Токен + "/sendMessage";   
		ЗапросКРесурсу = Новый HTTPЗапрос(ПутьКРесурсу); 
		ЗапросКРесурсу.Заголовки.Вставить("Content-Type", "application/json");  
		
		Параметры = Новый Структура;
		Параметры.Вставить("chat_id", ChatID);
		Параметры.Вставить("text", СообщениеДляОтправки);
					
		ТелоЗапроса = СериализаторXDTO.ЗаписатьJSON(Параметры); 
		ЗапросКРесурсу.УстановитьТелоИзСтроки(ТелоЗапроса);  
		Ответ = Соединение.ОтправитьДляОбработки(ЗапросКРесурсу,, "POST");
		
		Если Ответ.КодСостояния = 200 Тогда
			Сообщить("Сообщение отправлено успешно!"); 
			СообщениеДляОтправки.Удалить();
		Иначе
			ТекстОшибки = Ответ.ПолучитьТелоКакСтроку();
			Сообщить("Ошибка при отправке сообщения:" + ТекстОшибки);
		КонецЕсли; 
		
	КонецЦикла;	
		
КонецПроцедуры

#КонецОбласти
