
#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

     РассчитатьДвиженияПремии();  
	 
	 РассчитатьУдержания();
	 
	 СформироватьСуммуКВыплатеПремий();
         
КонецПроцедуры

Процедура РассчитатьДвиженияПремии()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_НачислениеФиксированныхПремийВКМ_НачисленияПремии.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
		|	ВКМ_НачислениеФиксированныхПремийВКМ_НачисленияПремии.ВКМ_Должность КАК ВКМ_Должность,
		|	ВКМ_НачислениеФиксированныхПремийВКМ_НачисленияПремии.ВидРасчета КАК ВидРасчета,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Премия КАК ВКМ_Премия
		|ИЗ
		|	Документ.ВКМ_НачислениеФиксированныхПремий.ВКМ_НачисленияПремии КАК ВКМ_НачислениеФиксированныхПремийВКМ_НачисленияПремии
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата, ) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|		ПО ВКМ_НачислениеФиксированныхПремийВКМ_НачисленияПремии.ВКМ_Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Сотрудник
		|			И ВКМ_НачислениеФиксированныхПремийВКМ_НачисленияПремии.ВКМ_Должность = ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Должность
		|ГДЕ
		|	ВКМ_НачислениеФиксированныхПремийВКМ_НачисленияПремии.Ссылка = &Ссылка
		|	И ВКМ_НачислениеФиксированныхПремийВКМ_НачисленияПремии.ВидРасчета = &Премия";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Премия", ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.РазоваяПремия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		 Если ТипЗнч(ВыборкаДетальныеЗаписи.ВидРасчета) <> Тип("ПланВидовРасчетаСсылка.ВКМ_ДополнительныеНачисления") Тогда
			Продолжить;
		КонецЕсли;
		
	    Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.ПериодРегистрации = Дата;  
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
		
		Движение.ВКМ_Начислено = ВыборкаДетальныеЗаписи.ВКМ_Премия; 
						
	КонецЦикла;
	
	Движения.ВКМ_ДополнительныеНачисления.Записать();
	
КонецПроцедуры 

Процедура РассчитатьУдержания()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ДополнительныеНачисления.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
		|	ВКМ_ДополнительныеНачисления.ВКМ_Должность КАК ВКМ_Должность,
		|	ВКМ_ДополнительныеНачисления.ВидРасчета КАК ВидРасчета,
		|	ВКМ_ДополнительныеНачисления.ВКМ_Начислено КАК ВКМ_Начислено,
		|	ЕСТЬNULL(ВКМ_ДополнительныеНачисления.ВКМ_Начислено * 13 / 100, 0) КАК ВКМ_НДФЛ
		|ИЗ
		|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
		|ГДЕ
		|	ВКМ_ДополнительныеНачисления.Регистратор = &Регистратор
		|	И ВКМ_ДополнительныеНачисления.ВидРасчета = &ВидРасчета";
	
	Запрос.УстановитьПараметр("Регистратор" , Ссылка);  
	Запрос.УстановитьПараметр("ВидРасчета" , ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.РазоваяПремия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл   	
		
		Движение = Движения.ВКМ_Удержания.Добавить();
		ЗаполнитьЗначенияСвойств(Движение,ВыборкаДетальныеЗаписи); 
		Движение.ПериодРегистрации = Дата; 		
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.РазоваяПремия;	
		Движение.ВКМ_Начислено = ВыборкаДетальныеЗаписи.ВКМ_Начислено;
		Движение.ВКМ_НДФЛ = ВыборкаДетальныеЗаписи.ВКМ_НДФЛ;
		
	КонецЦикла;	
				
	Если Движение.Сторно Тогда        
		
		Движение.ВКМ_Начислено = -Движение.ВКМ_Начислено;
		Движение.ВКМ_НДФЛ = -Движение.ВКМ_НДФЛ;   
		
	КонецЕсли;	 
	
	Движения.ВКМ_Удержания.Записать();  
		
КонецПроцедуры   

Процедура СформироватьСуммуКВыплатеПремий()
	
  Запрос = Новый Запрос;
  Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ДополнительныеНачисления.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
		|	ВКМ_ДополнительныеНачисления.ВКМ_Начислено КАК ВКМ_Начислено,
		|	ВКМ_Удержания.ВКМ_НДФЛ КАК ВКМ_НДФЛ
		|ИЗ
		|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
		|		ПО ВКМ_ДополнительныеНачисления.ВКМ_Сотрудник = ВКМ_Удержания.ВКМ_Сотрудник
		|			И ВКМ_ДополнительныеНачисления.ВКМ_Начислено = ВКМ_Удержания.ВКМ_Начислено
		|			И ВКМ_ДополнительныеНачисления.ВКМ_Должность = ВКМ_Удержания.ВКМ_Должность
		|ГДЕ
		|	ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка
		|	И ВКМ_Удержания.Регистратор = &Ссылка"; 
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл   
		
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить(); 
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ВКМ_Сотрудник = ВыборкаДетальныеЗаписи.ВКМ_Сотрудник;  
		
	    Движение.Сумма = ВыборкаДетальныеЗаписи.ВКМ_Начислено  - ВыборкаДетальныеЗаписи.ВКМ_НДФЛ; 
			
	КонецЦикла;
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();  
	
КонецПроцедуры	

#КонецОбласти