
#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

     РассчитатьДвиженияПремии(); 
         
КонецПроцедуры

Процедура РассчитатьДвиженияПремии()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_НачислениеФиксированныхПремийВКМ_НачисленияПремии.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
		|	ВКМ_НачислениеФиксированныхПремийВКМ_НачисленияПремии.ВКМ_Должность КАК ВКМ_Должность,
		|	ВКМ_НачислениеФиксированныхПремийВКМ_НачисленияПремии.ВКМ_ВидРасчета КАК ВидРасчета,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Премия КАК ВКМ_Премия
		|ИЗ
		|	Документ.ВКМ_НачислениеФиксированныхПремий.ВКМ_НачисленияПремии КАК ВКМ_НачислениеФиксированныхПремийВКМ_НачисленияПремии
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата, ) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|		ПО ВКМ_НачислениеФиксированныхПремийВКМ_НачисленияПремии.ВКМ_Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Сотрудник
		|			И ВКМ_НачислениеФиксированныхПремийВКМ_НачисленияПремии.ВКМ_Должность = ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Должность
		|ГДЕ
		|	ВКМ_НачислениеФиксированныхПремийВКМ_НачисленияПремии.Ссылка = &Ссылка
		|	И ВКМ_НачислениеФиксированныхПремийВКМ_НачисленияПремии.ВКМ_ВидРасчета = &Премия";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Премия", ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.РазоваяПремия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		 Если ТипЗнч(ВыборкаДетальныеЗаписи.ВидРасчета) <> Тип("ПланВидовРасчетаСсылка.ВКМ_ДополнительныеНачисления") Тогда
			Продолжить;
		КонецЕсли;
		
	    Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.ПериодРегистрации = Дата;  
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
		
		Движение.ВКМ_Начислено = ВыборкаДетальныеЗаписи.ВКМ_Премия;
		Движение.ВКМ_НДФЛ = ВыборкаДетальныеЗаписи.ВКМ_Премия * 13 / 100;   
		
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();  
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ВКМ_Сотрудник = ВыборкаДетальныеЗаписи.ВКМ_Сотрудник;
		Движение.Сумма = ВыборкаДетальныеЗаписи.ВКМ_Премия - (ВыборкаДетальныеЗаписи.ВКМ_Премия * 13 / 100);
				
	КонецЦикла;
	
	Движения.ВКМ_ДополнительныеНачисления.Записать();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	
КонецПроцедуры    

#КонецОбласти