
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

   Запрос = Новый Запрос;
   Запрос.Текст =
        	"ВЫБРАТЬ
        	|	ВКМ_ОбслуживаниеКлиента.ВКМ_Договор.ВидДоговора <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание) КАК ДоговорНеАбонентскоеОбслуживание,
        	|	ВКМ_ОбслуживаниеКлиента.Дата < ВКМ_ОбслуживаниеКлиента.ВКМ_Договор.ВКМ_ДатаНачалаДоговора
        	|		ИЛИ ВКМ_ОбслуживаниеКлиента.Дата > ВКМ_ОбслуживаниеКлиента.ВКМ_Договор.ВКМ_ДатаОкончанияДоговора КАК Дата
        	|ИЗ
        	|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
        	|ГДЕ
        	|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
        	
   Запрос.УстановитьПараметр("Ссылка", Ссылка);	
        
   РезультатЗапроса = Запрос.Выполнить();
        
   ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
        
   Если ВыборкаДетальныеЗаписи.Следующий() Тогда
        	
        Если ВыборкаДетальныеЗаписи.ДоговорНеАбонентскоеОбслуживание И ВыборкаДетальныеЗаписи.Дата Тогда
        		
        	  Отказ = Истина;
        	  Сообщение = СтрШаблон("Невозможно проведение документа по Договору %1", ВКМ_Договор);
        	  Сообщить(Сообщение);   
        	
        КонецЕсли;      	     	
        	
   КонецЕсли;
        
    Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
    Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
    Движение.Период = Дата;
	Движение.ВКМ_Клиент = ВКМ_Клиент;
	Движение.ВКМ_Договор = ВКМ_Договор;
	Движение.ВКМ_КоличествоЧасов = ВКМ_ВыполненныеРаботы.Итог("ВКМ_ЧасыКОплатеКлиенту");
				
     Запрос = Новый Запрос;
     Запрос.Текст =
        	"ВЫБРАТЬ
        	|	ВКМ_ОбслуживаниеКлиента.ВКМ_Договор.ВКМ_СтоимостьЧасаРаботы КАК ВКМ_ДоговорВКМ_СтоимостьЧасаРаботы
        	|ИЗ
        	|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
        	|ГДЕ
        	|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
        
     Запрос.УстановитьПараметр("Ссылка", Ссылка);
        
     РезультатЗапроса = Запрос.Выполнить();
        
     ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
        
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
        	Движение.ВКМ_СуммаКОплате = Движение.ВКМ_КоличествоЧасов * ВыборкаДетальныеЗаписи.ВКМ_ДоговорВКМ_СтоимостьЧасаРаботы;
    КонецЦикла;

    Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	
	Для Каждого ТекСтрокаВКМ_ВыполненныеРаботы из ВКМ_ВыполненныеРаботы Цикл
		
		Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.ВКМ_Сотрудник = ВКМ_Специалист; 
		Движение.ВКМ_Должность = ВКМ_ДолжностьСпециалиста;
		Движение.ВКМ_ЧасовКОплате = ТекСтрокаВКМ_ВыполненныеРаботы.ВКМ_ЧасыКОплатеКлиенту;
					
	КонецЦикла;

    Запрос = Новый Запрос;
    Запрос.Текст =
    	"ВЫБРАТЬ
    	|	ВКМ_Сотрудники.ВКМ_ПроцентЗаВыполненныеРаботыКлиентам КАК ВКМ_ПроцентЗаВыполненныеРаботыКлиентам
    	|ИЗ
    	|	Справочник.ВКМ_Сотрудники КАК ВКМ_Сотрудники
    	|ГДЕ
    	|	ВКМ_Сотрудники.Ссылка = &Ссылка";
    
    Запрос.УстановитьПараметр("Ссылка", ВКМ_Специалист);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
    	
		Если ВыборкаДетальныеЗаписи.ВКМ_ПроцентЗаВыполненныеРаботыКлиентам = "" Тогда
			Возврат;
		КонецЕсли;	
    	
    	Движение.ВКМ_СуммаКОплате = ТекСтрокаВКМ_ВыполненныеРаботы.ВКМ_ЧасыКОплатеКлиенту * ВКМ_Договор.ВКМ_СтоимостьЧасаРаботы * ВыборкаДетальныеЗаписи.ВКМ_ПроцентЗаВыполненныеРаботыКлиентам  / 100;
    	
    КонецЦикла;
    
КонецПроцедуры    

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	
	Если ОбменДанными.Загрузка Тогда
     Возврат;
	КонецЕсли;
		
	ВКМ_ТекстСообщения = ПолучитьТекстИзменения(); 
	
	Если Не ЗначениеЗаполнено(ВКМ_ТекстСообщения) Тогда
		Возврат;
	КонецЕсли;
	
	НовыйТекстИзменения = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(НовыйТекстИзменения, ЭтотОбъект); 
	
	НовыйТекстИзменения.Записать();
	
КонецПроцедуры  

Функция ПолучитьТекстИзменения()
	
	Если ЭтотОбъект.ЭтоНовый() Тогда
		
		ТекстСообщения = СтрШаблон("Создан новый документ специалистом %1 от %2", ВКМ_Специалист, Дата);
		
	КонецЕсли;  
	
	Если Не ЭтотОбъект.ЭтоНовый() Тогда  
		
		ДатаДокумента = '00010101';  
		
		Запрос = Новый Запрос; 
		Запрос.Текст = "ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Дата КАК Дата,
		|	ВКМ_ОбслуживаниеКлиента.ВКМ_Специалист КАК ВКМ_Специалист
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка"; 
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка); 
		
		Результат = Запрос.Выполнить(); 
		Выборка = Результат.Выбрать(); 
		
		Если Выборка.Следующий() Тогда   
			
			ДатаДокумента = Выборка.Дата;
			СпециалистВДокументе = Выборка.ВКМ_Специалист;
			
		КонецЕсли;    
		
		
		Если СпециалистВДокументе <> ВКМ_Специалист Тогда     
			
			ТекстСообщения = СтрШаблон("В документе %1 специалист %2 изменился на %3", Ссылка, СпециалистВДокументе, ВКМ_Специалист);     
			
		КонецЕсли; 
		
		Если ДатаДокумента <> Дата Тогда     
			
			ТекстСообщения = СтрШаблон("В документе %1 дата %2 изменилась на %3", Ссылка, ДатаДокумента, Дата);     
			
		КонецЕсли;
		
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		
		Возврат ТекстСообщения; 
		
	КонецЕсли;    
		
КонецФункции	
    
#КонецОбласти  

#КонецЕсли