
#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

   СформироватьДвижения();
                                                               
   РассчитатьОклад();  
   
   РассчитатьОтпускные(); 
      
   СформироватьСуммуКВыплате(); 
   
   СформироватьДанныеПоОтпускам();
         
КонецПроцедуры   

 Процедура СформироватьДвижения()
	
   СформироватьДвиженияПоОкладу(); 
   СформироватьДвиженияПрочиеОсновныеНачисления();
   СформироватьРассчитатьДвиженияДополнительныеНачисления();
   
   СформироватьСторноЗаписи();
   
   Движения.ВКМ_ОсновныеНачисления.Записать();  
   Движения.ВКМ_ДополнительныеНачисления.Записать();
     
КонецПроцедуры    

Процедура СформироватьДвиженияПоОкладу()
	
	Отбор = Новый Структура();
	Отбор.Вставить("ВКМ_ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	
	СтрокиОклада = ВКМ_Начисления.НайтиСтроки(Отбор);
	
	Если СтрокиОклада.Количество() = 0 Тогда
		Возврат
	КонецЕсли;
	
	МинимальнаяДатаНачала = СтрокиОклада[0].ВКМ_ДатаНачала;
	МаксимальнаяДатаОкончания = СтрокиОклада[0].ВКМ_ДатаОкончания;
	
	Для Сч = 1 по СтрокиОклада.Количество() - 1 Цикл 
		
		Если МинимальнаяДатаНачала > СтрокиОклада[0].ВКМ_ДатаНачала Тогда
			МинимальнаяДатаНачала = СтрокиОклада[0].ВКМ_ДатаНачала;
		КонецЕсли;
		
		Если МаксимальнаяДатаОкончания > СтрокиОклада[0].ВКМ_ДатаОкончания Тогда
			МаксимальнаяДатаОкончания = СтрокиОклада[0].ВКМ_ДатаОкончания;
		КонецЕсли;
		
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_НачислениеЗаработнойПлатыВКМ_Начисления.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
	               |	ВКМ_НачислениеЗаработнойПлатыВКМ_Начисления.ВКМ_Должность КАК ВКМ_Должность,
	               |	ВКМ_НачислениеЗаработнойПлатыВКМ_Начисления.ВКМ_ВидРасчета КАК ВКМ_ВидРасчета,
	               |	ВКМ_НачислениеЗаработнойПлатыВКМ_Начисления.ВКМ_ДатаНачала КАК ВКМ_ДатаНачала,
	               |	ВКМ_НачислениеЗаработнойПлатыВКМ_Начисления.ВКМ_ДатаОкончания КАК ВКМ_ДатаОкончания,
	               |	ВКМ_НачислениеЗаработнойПлатыВКМ_Начисления.ВКМ_ГрафикРаботы КАК ВКМ_ГрафикРаботы
	               |ПОМЕСТИТЬ ВТ_ПериодыОкладаИсходные
	               |ИЗ
	               |	Документ.ВКМ_НачислениеЗаработнойПлаты.ВКМ_Начисления КАК ВКМ_НачислениеЗаработнойПлатыВКМ_Начисления
	               |ГДЕ
	               |	ВКМ_НачислениеЗаработнойПлатыВКМ_Начисления.Ссылка = &Ссылка
	               |	И ВКМ_НачислениеЗаработнойПлатыВКМ_Начисления.ВКМ_ВидРасчета = &Оклад
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Период КАК ВКМ_Период,
	               |	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
	               |	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Должность КАК ВКМ_Должность,
	               |	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Оклад КАК ВКМ_Оклад
	               |ПОМЕСТИТЬ ВТ_ИзмененияОклада
	               |ИЗ
	               |	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(
	               |			&МинимальнаяДатаНачала,
	               |			(ВКМ_Сотрудник, ВКМ_Должность) В
	               |				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |					ВТ_ПериодыОкладаИсходные.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
	               |					ВТ_ПериодыОкладаИсходные.ВКМ_Должность КАК ВКМ_Должность
	               |				ИЗ
	               |					ВТ_ПериодыОкладаИсходные КАК ВТ_ПериодыОкладаИсходные)) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВКМ_УсловияОплатыСотрудников.Период,
	               |	ВКМ_УсловияОплатыСотрудников.ВКМ_Сотрудник,
	               |	ВКМ_УсловияОплатыСотрудников.ВКМ_Должность,
	               |	ВКМ_УсловияОплатыСотрудников.ВКМ_Оклад
	               |ИЗ
	               |	РегистрСведений.ВКМ_УсловияОплатыСотрудников КАК ВКМ_УсловияОплатыСотрудников
	               |ГДЕ
	               |	ВКМ_УсловияОплатыСотрудников.Период > &МинимальнаяДатаНачала
	               |	И ВКМ_УсловияОплатыСотрудников.Период <= &МаксимальнаяДатаОкончания
	               |	И (ВКМ_УсловияОплатыСотрудников.ВКМ_Сотрудник, ВКМ_УсловияОплатыСотрудников.ВКМ_Должность) В
	               |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |				ВТ_ПериодыОкладаИсходные.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
	               |				ВТ_ПериодыОкладаИсходные.ВКМ_Должность КАК ВКМ_Должность
	               |			ИЗ
	               |				ВТ_ПериодыОкладаИсходные КАК ВТ_ПериодыОкладаИсходные)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДатаНачала.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
	               |	ДатаНачала.ВКМ_Должность КАК ВКМ_Должность,
	               |	ДатаНачала.ВКМ_Период КАК ВКМ_ДатаНачала,
	               |	ДатаНачала.ВКМ_Оклад КАК ВКМ_Оклад,
	               |	МИНИМУМ(ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ДатаОкончания.ВКМ_Период, СЕКУНДА, -1), ДАТАВРЕМЯ(3999, 12, 31))) КАК ВКМ_ДатаОкончания
	               |ПОМЕСТИТЬ ВТ_ИнтервалыОклада
	               |ИЗ
	               |	ВТ_ИзмененияОклада КАК ДатаНачала
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИзмененияОклада КАК ДатаОкончания
	               |		ПО ДатаНачала.ВКМ_Сотрудник = ДатаОкончания.ВКМ_Сотрудник
	               |			И ДатаНачала.ВКМ_Должность = ДатаОкончания.ВКМ_Должность
	               |			И ДатаНачала.ВКМ_Период < ДатаОкончания.ВКМ_Период
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДатаНачала.ВКМ_Сотрудник,
	               |	ДатаНачала.ВКМ_Должность,
	               |	ДатаНачала.ВКМ_Период,
	               |	ДатаНачала.ВКМ_Оклад
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ПериодыОкладаИсходные.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
	               |	ВТ_ПериодыОкладаИсходные.ВКМ_ВидРасчета КАК ВидРасчета,
	               |	ВТ_ПериодыОкладаИсходные.ВКМ_Должность КАК ВКМ_Должность,
	               |	ВТ_ИнтервалыОклада.ВКМ_Оклад КАК ВКМ_Оклад,
	               |	ВТ_ПериодыОкладаИсходные.ВКМ_ГрафикРаботы КАК ВКМ_ГрафикРаботы,
	               |	ВЫБОР
	               |		КОГДА ВТ_ИнтервалыОклада.ВКМ_ДатаНачала > ВТ_ПериодыОкладаИсходные.ВКМ_ДатаНачала
	               |			ТОГДА ВТ_ИнтервалыОклада.ВКМ_ДатаНачала
	               |		ИНАЧЕ ВТ_ПериодыОкладаИсходные.ВКМ_ДатаНачала
	               |	КОНЕЦ КАК ПериодДействияНачало,
	               |	ВЫБОР
	               |		КОГДА ВТ_ИнтервалыОклада.ВКМ_ДатаОкончания < ВТ_ПериодыОкладаИсходные.ВКМ_ДатаОкончания
	               |			ТОГДА ВТ_ИнтервалыОклада.ВКМ_ДатаОкончания
	               |		ИНАЧЕ ВТ_ПериодыОкладаИсходные.ВКМ_ДатаОкончания
	               |	КОНЕЦ КАК ПериодДействияКонец
	               |ИЗ
	               |	ВТ_ПериодыОкладаИсходные КАК ВТ_ПериодыОкладаИсходные
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ИнтервалыОклада КАК ВТ_ИнтервалыОклада
	               |		ПО ВТ_ПериодыОкладаИсходные.ВКМ_Сотрудник = ВТ_ИнтервалыОклада.ВКМ_Сотрудник
	               |			И ВТ_ПериодыОкладаИсходные.ВКМ_Должность = ВТ_ИнтервалыОклада.ВКМ_Должность
	               |			И ВТ_ПериодыОкладаИсходные.ВКМ_ДатаНачала <= ВТ_ИнтервалыОклада.ВКМ_ДатаОкончания
	               |			И (ВТ_ИнтервалыОклада.ВКМ_ДатаНачала <= ВТ_ПериодыОкладаИсходные.ВКМ_ДатаОкончания)";
	
	Запрос.УстановитьПараметр("Оклад", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	Запрос.УстановитьПараметр("МаксимальнаяДатаОкончания", МаксимальнаяДатаОкончания);
	Запрос.УстановитьПараметр("МинимальнаяДатаНачала", МинимальнаяДатаНачала); 
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	
			Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
			Движение.ПериодРегистрации = Дата;
			Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
			Движение.БазовыйПериодКонец = КонецМесяца(Дата);

	КонецЦикла; 
				
КонецПроцедуры  

Процедура СформироватьДвиженияПрочиеОсновныеНачисления()
	
	   Для Каждого Строка Из ВКМ_Начисления Цикл
		
		Если ТипЗнч(Строка.ВКМ_ВидРасчета) <> Тип("ПланВидовРасчетаСсылка.ВКМ_ОсновныеНачисления") Тогда
			Продолжить;
		КонецЕсли;	
	
	    Если Строка.ВКМ_ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад Тогда
			Продолжить;
		КонецЕсли; 
		
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.ПериодДействияНачало = Строка.ВКМ_ДатаНачала;
		Движение.ПериодДействияКонец = Строка.ВКМ_ДатаОкончания;
		Движение.ВидРасчета = Строка.ВКМ_ВидРасчета;
		Движение.ВКМ_Сотрудник = Строка.ВКМ_Сотрудник; 
		Движение.ВКМ_Должность = Строка.ВКМ_Должность; 
		Движение.ВКМ_ГрафикРаботы = Строка.ВКМ_ГрафикРаботы;
				
		Если Строка.ВКМ_ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпускные Тогда
			
			Движение.БазовыйПериодНачало = НачалоМесяца(ДобавитьМесяц(Строка.ВКМ_ДатаНачала, -12));
			Движение.БазовыйПериодКонец = КонецМесяца(ДобавитьМесяц(Строка.ВКМ_ДатаОкончания, -1));
			
		КонецЕсли;		
		
	КонецЦикла;	 
		
КонецПроцедуры  

Процедура СформироватьСторноЗаписи()
	
	 СторноЗаписи = Движения.ВКМ_ОсновныеНачисления.ПолучитьДополнение();
	 
	 Для Каждого Строка Из СторноЗаписи Цикл
		 
		 Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		 ЗаполнитьЗначенияСвойств(Движение, Строка);
		 
		 Движение.ПериодРегистрации = Дата;
		 Движение.ПериодДействияНачало = Строка.ПериодДействияНачалоСторно;
		 Движение.ПериодДействияКонец = Строка.ПериодДействияКонецСторно;
		 Движение.Сторно = Истина;     
		 
	 КонецЦикла;		
	 
КонецПроцедуры   

Процедура РассчитатьОклад()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия КАК Факт,
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия КАК Норма
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(
		|			ВидРасчета = &Оклад
		|				И Регистратор = &Ссылка) КАК ВКМ_ОсновныеНачисленияДанныеГрафика";
	
	Запрос.УстановитьПараметр("Оклад", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	Запрос.УстановитьПараметр("Ссылка", Ссылка); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		
		Движение = Движения.ВКМ_ОсновныеНачисления[ВыборкаДетальныеЗаписи.НомерСтроки - 1];			
		Движение.ВКМ_Начислено = Движение.ВКМ_Оклад * ВыборкаДетальныеЗаписи.Факт / ВыборкаДетальныеЗаписи.Норма;
		Движение.ВКМ_НДФЛ = (Движение.ВКМ_Оклад * ВыборкаДетальныеЗаписи.Факт / ВыборкаДетальныеЗаписи.Норма) * 13 / 100;
		Движение.ВКМ_ОтработаноДней = ВыборкаДетальныеЗаписи.Факт;
		
		Если Движение.Сторно Тогда        
			
			Движение.ВКМ_ОтработаноДней = -Движение.ВКМ_ОтработаноДней;
			Движение.ВКМ_Начислено = -Движение.ВКМ_Начислено;
			Движение.ВКМ_НДФЛ = -Движение.ВКМ_НДФЛ;   
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);  
	
КонецПроцедуры 

Процедура РассчитатьОтпускные();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ВКМ_НачисленоБаза, 0) КАК База,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ВКМ_ОтработаноДнейБаза, 0) КАК БазаОтработано,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК Факт
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ОсновныеНачисления(&Измерения, &Измерения, , ) КАК ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления
		|		ПО ВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(
		|				Регистратор = &Ссылка
		|					И ВидРасчета = &Отпускные) КАК ВКМ_ОсновныеНачисленияДанныеГрафика
		|		ПО ВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки
		|ГДЕ
		|	ВКМ_ОсновныеНачисления.Регистратор = &Ссылка
		|	И ВКМ_ОсновныеНачисления.ВидРасчета = &Отпускные";  
	
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка); 
	Запрос.УстановитьПараметр("Отпускные", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпускные);
	
	Измерения = Новый Массив;
	Измерения.Добавить("ВКМ_Должность");
	Измерения.Добавить("ВКМ_Сотрудник");
	
	Запрос.УстановитьПараметр("Измерения", Измерения);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		 Движение = Движения.ВКМ_ОсновныеНачисления[ВыборкаДетальныеЗаписи.НомерСтроки - 1];
		 
		 Движение.ВКМ_ОтработаноДней = ВыборкаДетальныеЗаписи.Факт;
		 
		 Если ВыборкаДетальныеЗаписи.БазаОтработано = 0 Тогда
			 Движение.ВКМ_Начислено = 0;
			 Движение.ВКМ_НДФЛ = 0;
			 Продолжить;
		 КонецЕсли;	 
		 
		 Движение.ВКМ_Начислено = ВыборкаДетальныеЗаписи.База / ВыборкаДетальныеЗаписи.БазаОтработано * ВыборкаДетальныеЗаписи.Факт;
		 Движение.ВКМ_НДФЛ = (ВыборкаДетальныеЗаписи.База / ВыборкаДетальныеЗаписи.БазаОтработано * ВыборкаДетальныеЗаписи.Факт) * 13 /100;
		 
		 Если Движение.Сторно Тогда
			 
			 Движение.ВКМ_ОтработаноДней = -Движение.ВКМ_ОтработаноДней;
			 Движение.ВКМ_НДФЛ = -Движение.ВКМ_НДФЛ;
			 Движение.ВКМ_Начислено = -Движение.ВКМ_Начислено;
			 
		 КонецЕсли;	 
			
	КонецЦикла;
	
	     Движения.ВКМ_ОсновныеНачисления.Записать(, Истина); 
	
КонецПроцедуры    

Процедура СформироватьРассчитатьДвиженияДополнительныеНачисления();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_НачислениеЗаработнойПлатыВКМ_Начисления.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
		|	ВКМ_НачислениеЗаработнойПлатыВКМ_Начисления.ВКМ_Должность КАК ВКМ_Должность,
		|	ВКМ_НачислениеЗаработнойПлатыВКМ_Начисления.ВКМ_ВидРасчета КАК ВидРасчета,
		|	ВКМ_ВыполненныеСотрудникомРаботыОстатки.ВКМ_СуммаКОплатеОстаток КАК ВКМ_СуммаКОплатеОстаток
		|ИЗ
		|	Документ.ВКМ_НачислениеЗаработнойПлаты.ВКМ_Начисления КАК ВКМ_НачислениеЗаработнойПлатыВКМ_Начисления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Остатки(&Дата, ) КАК ВКМ_ВыполненныеСотрудникомРаботыОстатки
		|		ПО ВКМ_НачислениеЗаработнойПлатыВКМ_Начисления.ВКМ_Сотрудник = ВКМ_ВыполненныеСотрудникомРаботыОстатки.ВКМ_Сотрудник
		|			И ВКМ_НачислениеЗаработнойПлатыВКМ_Начисления.ВКМ_Должность = ВКМ_ВыполненныеСотрудникомРаботыОстатки.ВКМ_Должность
		|ГДЕ
		|	ВКМ_НачислениеЗаработнойПлатыВКМ_Начисления.Ссылка = &Ссылка
		|	И ВКМ_НачислениеЗаработнойПлатыВКМ_Начисления.ВКМ_ВидРасчета = &Надбавка";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Надбавка", ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.НадбавкаЗаВыполненныеРаботы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		 Если ТипЗнч(ВыборкаДетальныеЗаписи.ВидРасчета) <> Тип("ПланВидовРасчетаСсылка.ВКМ_ДополнительныеНачисления") Тогда
			Продолжить;
		КонецЕсли;
		
	    Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.ПериодРегистрации = Дата;  
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
		
		Движение.ВКМ_Начислено = ВыборкаДетальныеЗаписи.ВКМ_СуммаКОплатеОстаток;
		Движение.ВКМ_НДФЛ = ВыборкаДетальныеЗаписи.ВКМ_СуммаКОплатеОстаток * 13 / 100; 
		
	КонецЦикла;
		
КонецПроцедуры 

Процедура СформироватьСуммуКВыплате()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисления.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
		|	СУММА(ЕСТЬNULL(ВКМ_ОсновныеНачисления.ВКМ_Начислено, 0)) КАК ВКМ_Начислено,
		|	СУММА(ЕСТЬNULL(ВКМ_ОсновныеНачисления.ВКМ_НДФЛ, 0)) КАК ВКМ_НДФЛ
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
		|ГДЕ
		|	ВКМ_ОсновныеНачисления.Регистратор.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОсновныеНачисления.ВКМ_Сотрудник
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВКМ_ДополнительныеНачисления.ВКМ_Сотрудник,
		|	ЕСТЬNULL(ВКМ_ДополнительныеНачисления.ВКМ_Начислено, 0),
		|	ЕСТЬNULL(ВКМ_ДополнительныеНачисления.ВКМ_НДФЛ, 0)
		|ИЗ
		|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
		|ГДЕ
		|	ВКМ_ДополнительныеНачисления.Регистратор.Ссылка = &Ссылка"; 
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл   
		
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить(); 
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ВКМ_Сотрудник = ВыборкаДетальныеЗаписи.ВКМ_Сотрудник;  
		
	    Движение.Сумма = ВыборкаДетальныеЗаписи.ВКМ_Начислено  - ВыборкаДетальныеЗаписи.ВКМ_НДФЛ; 
			
	КонецЦикла;
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	
КонецПроцедуры   

Процедура СформироватьДанныеПоОтпускам()  
	
	Для Каждого Строка Из ВКМ_Начисления Цикл
		
		Если Строка.ВКМ_ВидРасчета <> ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпускные Тогда
			Продолжить;
		КонецЕсли;			
		
		Движение = Движения.ВКМ_ДанныеПоОтпускамСотрудников.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;       			
		Движение.Период = Строка.ВКМ_ДатаНачала;  	
		Движение.Сотрудник = Строка.ВКМ_Сотрудник;
		Движение.ДнейОтпуска = Окр((КонецДня(Строка.ВКМ_ДатаОкончания) - НачалоДня(Строка.ВКМ_ДатаНачала))/(60*60*24),0, РежимОкругления.Окр15как20);
		
	КонецЦикла; 
	
	Движения.ВКМ_ДанныеПоОтпускамСотрудников.Записать();
	
КонецПроцедуры	

#КонецОбласти