
//Ирина Добавляем реквизиты и поля в элементы формы
#Область ПрограммныйИнтерфейс  

Процедура ВКМ_ДополнитьФорму(Форма) Экспорт
	
	  ИмяФормы = Форма.ИмяФормы;
	  
	  Если ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ФормаЭлемента" Тогда
		  ВКМ_ДобавлениеЭлементовФормы(Форма);
      КонецЕсли;  

 КонецПроцедуры
 
#КонецОбласти    

#Область СлужебныйКомандныйИнтерфейс    

Процедура ВКМ_ДобавлениеЭлементовФормы(Форма)
	
	НоваяГруппаДатыНачалаОкончания = Форма.Элементы.Добавить("ВКМ_ДатыНачалаОкончания", Тип("ГруппаФормы"), Форма);
	НоваяГруппаДатыНачалаОкончания.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппаДатыНачалаОкончания.ОтображатьЗаголовок = Ложь;
	НоваяГруппаДатыНачалаОкончания.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	НоваяГруппаСуммаСтоимостьЧаса = Форма.Элементы.Добавить("ВКМ_СуммаСтоимостьЧаса", Тип("ГруппаФормы"), Форма);
	НоваяГруппаСуммаСтоимостьЧаса.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппаСуммаСтоимостьЧаса.ОтображатьЗаголовок = Ложь;
	НоваяГруппаСуммаСтоимостьЧаса.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	НовыйЭлемент = Форма.Элементы.Добавить("ВКМ_ДатаНачалаДоговора", Тип("ПолеФормы"), НоваяГруппаДатыНачалаОкончания);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ВКМ_ДатаНачалаДоговора";
	
	НовыйЭлемент = Форма.Элементы.Добавить("ВКМ_ДатаОкончанияДоговора", Тип("ПолеФормы"), НоваяГруппаДатыНачалаОкончания);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ВКМ_ДатаОкончанияДоговора";  
	
	НовыйЭлемент = Форма.Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"), НоваяГруппаСуммаСтоимостьЧаса);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ВКМ_СуммаАбонентскойПлаты";
	
	НовыйЭлемент = Форма.Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"), НоваяГруппаСуммаСтоимостьЧаса);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ВКМ_СтоимостьЧасаРаботы"; 
		
КонецПроцедуры 

#КонецОбласти   
//Ирина Конец
