
#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент)
	ОтпускаСотрудниковПриИзмененииНаСервере();
КонецПроцедуры  

&НаСервере
Процедура ОтпускаСотрудниковПриИзмененииНаСервере()
	
	Для Каждого Сотрудник Из Объект.ОтпускаСотрудников Цикл
		
		Сотрудник.КоличествоДнейОтпуска = Окр((КонецДня(Сотрудник.ДатаОкончания) - НачалоДня(Сотрудник.ДатаНачала))/(60*60*24),0, РежимОкругления.Окр15как20);
				
    КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДиаграммаОтпусков(Команда) 
	
	ДанныеВоВременномХранилище = ДанныеВоВременномХранилище(); 
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДанныеВоВременномХранилище", ДанныеВоВременномХранилище);
		
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы);
	
КонецПроцедуры 

&НаСервере
Функция ДанныеВоВременномХранилище() Экспорт  	
	
    ОтпускаСотрудниковМассив = Новый Массив;
    	
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл 
		
		ОтпускаСотрудниковСтруктура = Новый Структура;

		Сотрудник = Строка.Сотрудник; 
		ДатаНачала = Строка.ДатаНачала; 
		ДатаОкончания = Строка.ДатаОкончания;
		
	    ОтпускаСотрудниковСтруктура.Вставить("Сотрудник", Сотрудник);
		ОтпускаСотрудниковСтруктура.Вставить("ДатаНачала", ДатаНачала);
		ОтпускаСотрудниковСтруктура.Вставить("ДатаОкончания", ДатаОкончания);
		
		ОтпускаСотрудниковМассив.Добавить(ОтпускаСотрудниковСтруктура);    
		
	КонецЦикла; 
	
    АдресВоВремХранилище = ПоместитьВоВременноеХранилище(ОтпускаСотрудниковМассив, Новый УникальныйИдентификатор); 
	
	Возврат АдресВоВремХранилище;
	
КонецФункции 

#КонецОбласти
