
Функция СоздатьРеализацииНаСервере(СписокДоговоров, ВыбранныйПериод) Экспорт 	 
	        
	Если СписокДоговоров.Количество() > 0 Тогда
		
		Для Каждого Строка Из СписокДоговоров Цикл
			
			НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НовыйДокумент.Дата = ВыбранныйПериод;
			НовыйДокумент.Контрагент = Строка.Владелец;
			НовыйДокумент.Организация = Строка.Организация;
			НовыйДокумент.Договор = Строка;  
			НовыйДокумент.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			
			ЗаполнитьЗначенияСвойств(НовыйДокумент, Строка);
			
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			
			НовыйДокумент.ВыполнитьАвтозаполнение();              
			
			Если НЕ НовыйДокумент.ПроверитьЗаполнение() Тогда
				Сообщить("Документ не заполнен");
				Продолжить;
			КонецЕсли;
			
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	Возврат НовыйДокумент;
    
КонецФункции
