
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)      
	
	ОтпускаСотрудниковМассив = ПолучитьИзВременногоХранилища(Параметры.ДанныеВоВременномХранилище);   
	
	ДиаграммаГанта.Обновление = Ложь;
	ДиаграммаГанта.Очистить();  
	
	СерияОтпуск = ДиаграммаГанта.Серии.Добавить();
	СерияОтпуск.Текст = "Отпуск";

	Для Каждого Строка  Из  ОтпускаСотрудниковМассив Цикл   
	  		
		ТочкаСотрудник = ДиаграммаГанта.Точки.Добавить();
		ТочкаСотрудник.Текст = Строка.Сотрудник;  				
		
		ЗначениеСотрудник = ДиаграммаГанта.ПолучитьЗначение(ТочкаСотрудник, СерияОтпуск); 
			
		Интервал = ЗначениеСотрудник.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;
		
	КонецЦикла;	   	
	
	ДиаграммаГанта.Обновление = Истина;
	
КонецПроцедуры
