
#Область  ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим) 
	
	Движения.ВКМ_ДанныеПоОтпускамСотрудников.Записывать = Истина;
	
	Для Каждого ТекСтрокаОтпускаСотрудников Из ОтпускаСотрудников Цикл 
		
		Движение = Движения.ВКМ_ДанныеПоОтпускамСотрудников.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ТекСтрокаОтпускаСотрудников.ДатаНачала;
		Движение.Сотрудник = ТекСтрокаОтпускаСотрудников.Сотрудник;
		Движение.ДнейОтпуска = ТекСтрокаОтпускаСотрудников.КоличествоДнейОтпуска; 
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
 