 
 //Ирина Общий модуль - Подключаемые команды
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НоваяГруппаДатыНачалаОкончания = Элементы.Добавить("ВКМ_ДатыНачалаОкончания", Тип("ГруппаФормы"));
	НоваяГруппаДатыНачалаОкончания.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппаДатыНачалаОкончания.ОтображатьЗаголовок = Ложь;
	НоваяГруппаДатыНачалаОкончания.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НоваяГруппаДатыНачалаОкончания.Видимость = Ложь;
	
	НоваяГруппаСуммаСтоимостьЧаса = Элементы.Добавить("ВКМ_СуммаСтоимостьЧаса", Тип("ГруппаФормы"));
	НоваяГруппаСуммаСтоимостьЧаса.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппаСуммаСтоимостьЧаса.ОтображатьЗаголовок = Ложь;
	НоваяГруппаСуммаСтоимостьЧаса.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НоваяГруппаСуммаСтоимостьЧаса.Видимость = Ложь;
	
	НовыйЭлементВКМДатаНачалаДоговора = Элементы.Добавить("ВКМ_ДатаНачалаДоговора", Тип("ПолеФормы"), НоваяГруппаДатыНачалаОкончания);
	НовыйЭлементВКМДатаНачалаДоговора.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлементВКМДатаНачалаДоговора.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДоговора";
	НовыйЭлементВКМДатаНачалаДоговора.Видимость = Ложь;
	
	НовыйЭлементВКМДатаОкончанияДоговора = Элементы.Добавить("ВКМ_ДатаОкончанияДоговора", Тип("ПолеФормы"), НоваяГруппаДатыНачалаОкончания);
	НовыйЭлементВКМДатаОкончанияДоговора.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлементВКМДатаОкончанияДоговора.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДоговора";
	НовыйЭлементВКМДатаОкончанияДоговора.Видимость = Ложь;  
	
	НовыйЭлементВКМСуммаАбонентскойПлаты = Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"), НоваяГруппаСуммаСтоимостьЧаса);
	НовыйЭлементВКМСуммаАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлементВКМСуммаАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	НовыйЭлементВКМСуммаАбонентскойПлаты.Видимость = Ложь;
	
	НовыйЭлементВКМСтоимостьЧасаРаботы = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"), НоваяГруппаСуммаСтоимостьЧаса);
	НовыйЭлементВКМСтоимостьЧасаРаботы.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлементВКМСтоимостьЧасаРаботы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы"; 
	НовыйЭлементВКМСтоимостьЧасаРаботы.Видимость = Ложь;
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
		    		
		 Элементы.ВКМ_ДатыНачалаОкончания.Видимость = Истина;
	     Элементы.ВКМ_ДатаНачалаДоговора.Видимость = Истина;
	     Элементы.ВКМ_ДатаОкончанияДоговора.Видимость = Истина;
	
	     Элементы.ВКМ_СуммаСтоимостьЧаса.Видимость = Истина;
	     Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;
	     Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;    		
 	 
	КонецЕсли;	
			
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	
	// Если выбрать Истина только по виду договора Абонентское обслуживание, то при при первом выборе Абонентское обслуживание и переходе на Покупатель, Поставшщик код работает, 
	// но если вернуться обратно на Абонентское обслуживание, то видимость пропадает, поэтому делаю код при выборе и того и другого, тогда код работает всегда.	
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Покупатель Или  Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Поставщик Тогда 
		
		 Элементы.ВКМ_ДатыНачалаОкончания.Видимость = Ложь;
	     Элементы.ВКМ_ДатаНачалаДоговора.Видимость = Ложь;
	     Элементы.ВКМ_ДатаОкончанияДоговора.Видимость = Ложь;
	
	     Элементы.ВКМ_СуммаСтоимостьЧаса.Видимость = Ложь;
	     Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
	     Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;
	     
	ИначеЕсли Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
		    		
		 Элементы.ВКМ_ДатыНачалаОкончания.Видимость = Истина;
	     Элементы.ВКМ_ДатаНачалаДоговора.Видимость = Истина;
	     Элементы.ВКМ_ДатаОкончанияДоговора.Видимость = Истина;
	
	     Элементы.ВКМ_СуммаСтоимостьЧаса.Видимость = Истина;
	     Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;
	     Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;    		
 	 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

//Ирина Конец