 
 //Ирина Общий модуль - Подключаемые команды
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
			
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
	
		// СтандартныеПодсистемы.ПодключаемыеКоманды
		   ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
		// Конец СтандартныеПодсистемы.ПодключаемыеКоманды   
		
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда 
								   
		// СтандартныеПодсистемы.ПодключаемыеКоманды
	        ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
		// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
		
    ИначеЕсли Объект.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание 
		                           И Элементы.Найти("ВКМ_ДатыНачалаОкончания") <> Неопределено 
								   И Элементы.Найти("ВКМ_СуммаСтоимостьЧаса") <> Неопределено  Тогда 
								   								   
		Элементы.Удалить(Элементы.ВКМ_ДатыНачалаОкончания);						   
		Элементы.Удалить(Элементы.ВКМ_СуммаСтоимостьЧаса);	     	 	 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти     
//Ирина Конец