
#Область ОбработчикиКомандФормы

&НаСервере
Процедура ЗаполнитьНаСервере()  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ВзаиморасчетыССотрудникамиОбороты.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
		|	ВКМ_ВзаиморасчетыССотрудникамиОбороты.СуммаОборот КАК Сумма
		|ИЗ
		|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Обороты(, , , ) КАК ВКМ_ВзаиморасчетыССотрудникамиОбороты";
	
	
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();  
	
	Объект.Выплаты.Очистить();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл    	
				
		НоваяСтрока = Объект.Выплаты.Добавить();
		НоваяСтрока.Сотрудник = ВыборкаДетальныеЗаписи.ВКМ_Сотрудник;  
		НоваяСтрока.Сумма = ВыборкаДетальныеЗаписи.Сумма;
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

#КонецОбласти
