
#Область ОбработчикиСобытий

Функция TelegramBotOtpravkasms(Запрос)
	
	 Сервер = "api.telegram.org";
         ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
      Попытка
         Соединение = Новый HTTPСоединение(Сервер, 443, , , , 30, ЗащищенноеСоединение);
      Исключение
         ЗаписьЖурналаРегистрации("Telegram.ОшибкаСоединения", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
      Возврат "";
      
      КонецПопытки;
	
	ПараметрыЗапроса = Новый Структура;
    ПараметрыЗапроса.Вставить("chat_id", "290110051"); 
    ПараметрыЗапроса.Вставить("text", "Привет из 1С! Это тестовое уведомление.");
    ПараметрыЗапроса.Вставить("parse_mode", "Markdown");
 
    ЗаписьJSON = Новый ЗаписьJSON;
    ЗаписьJSON.УстановитьСтроку();
    ЗаписатьJSON(ЗаписьJSON, ПараметрыЗапроса);
    СтрокаJSON = ЗаписьJSON.Закрыть();
    
    ТокенБот = "8609080108:AAH-hMAU7h3JAnkPfmH_Hr4V0Uoe6d0Siio";
    Ресурс = "bot" + ТокенБот + "/sendMessage";
 
    Запрос = Новый HTTPЗапрос(Ресурс);
    Запрос.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
    Запрос.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8);
 
    Попытка
        Ответ = Соединение.ОтправитьДляОбработки(Запрос);
    Если Ответ.КодСостояния = 200 Тогда
        Сообщить("Сообщение успешно отправлено!");
    Иначе
        Сообщить("Ошибка отправки. Код состояния: " + Ответ.КодСостояния);
    КонецЕсли;
    
    Исключение
        Сообщить("Сетевая ошибка: " + ОписаниеОшибки());
    КонецПопытки;
    
    Если Ответ.КодСостояния = 200 Тогда
       Чтение = Новый ЧтениеJSON;
       Чтение.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
       Результат = ПрочитатьJSON(Чтение);
       Чтение.Закрыть();
    
    Если Результат.ok Тогда
        ИДСообщения = Результат.result.message_id;
    КонецЕсли;
   
КонецЕсли;
	
КонецФункции

#КонецОбласти

