
#Область ОбработчикиКомандФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    ДоговорыКонтрагентов = ПолучитьДоговорыКонтрагентов();
    
    Если ДоговорыКонтрагентов.Количество() > 0 Тогда 
    	
        Для Каждого Договор Из ДоговорыКонтрагентов Цикл
        	
            НоваяСтрока = Объект.СписокДоговоров.Добавить(); 
            НоваяСтрока.Договор = Договор; 
            
        КонецЦикла; 
        
    КонецЕсли;
    
КонецПроцедуры 

&НаСервере
Функция ПолучитьДоговорыКонтрагентов()
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	ДоговорыКонтрагентов.Ссылка КАК Ссылка
        |ИЗ
        |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
        |ГДЕ
        |	НЕ ДоговорыКонтрагентов.ПометкаУдаления
        |	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание)";
          
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Выборка = РезультатЗапроса.Выбрать();
    
    МассивДоговоров = Новый Массив; 
    
    Пока Выборка.Следующий() Цикл
    	
        МассивДоговоров.Добавить(Выборка.Ссылка);
        
    КонецЦикла;  
    
    Возврат МассивДоговоров;     
    
КонецФункции

&НаКлиенте
Процедура ВКМ_СоздатьДокументы(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ВКМ_Период) Тогда 
        Сообщить("Не заполнен период"); 
        Возврат; 
	КонецЕсли;
	
	СоздатьРеализацииНаСервере();

КонецПроцедуры
    
&НаСервере
Процедура СоздатьРеализацииНаСервере() Экспорт
	
	Данные = Объект.СписокДоговоров.Выгрузить().Выгрузитьколонку("Договор");
    Период = Объект.ВКМ_Период;
	
	ЕстьРеализации = ПроверитьРеализациюНаПериод(Период);

    Если ЕстьРеализации Тогда
        Сообщить("Уже созданы реализации за этот период"); 
        Возврат;     
    КонецЕсли;     
        
    Если Данные.Количество() > 0 Тогда
 
        Для Каждого Строка Из Данные Цикл

            НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
            НовыйДокумент.Дата = Период;
            НовыйДокумент.Контрагент = Строка.Владелец;
            НовыйДокумент.Организация = Строка.Организация;
            НовыйДокумент.Договор = Строка; 
            
            ЗаполнитьЗначенияСвойств(НовыйДокумент, Строка);
                        
            НовыйДокумент.ВыполнитьАвтозаполнение();              
                    
            Если НЕ НовыйДокумент.ПроверитьЗаполнение() Тогда
                    Возврат;
            КонецЕсли;

            НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);

        КонецЦикла; 
        
    КонецЕсли;    
    
КонецПроцедуры
 
Функция ПроверитьРеализациюНаПериод(Период) 
        
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |    РеализацияТоваровУслуг.Ссылка КАК Ссылка
        |ИЗ
        |    Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
        |ГДЕ
        |    НЕ РеализацияТоваровУслуг.ПометкаУдаления
        |    И РеализацияТоваровУслуг.Дата = &Дата";
    
    Запрос.УстановитьПараметр("Дата", Период);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Выборка = РезультатЗапроса.Выбрать();
    
    Если Выборка.Следующий() Тогда
        Возврат Истина; 
    Иначе 
        Возврат Ложь; 
    КонецЕсли;
        
КонецФункции

&НаКлиенте
Процедура ОбработатьДанные(Результат, ЛогЗагрузки) Экспорт
    
    ЗаполнитьРеализацииНаСервере(); 
    
КонецПроцедуры

&НаСервере
Функция ТаблицаЗначенийВМассив(ТаблицаЗначений) Экспорт
    
    Массив = Новый Массив();
    СтруктураСтрокой = "";
    НужнаЗапятая = Ложь;
    
    Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
    	
        Если НужнаЗапятая Тогда
        	
            СтруктураСтрокой = СтруктураСтрокой + ",";
        КонецЕсли;
        
        СтруктураСтрокой = СтруктураСтрокой + Колонка.Имя;
        НужнаЗапятая = Истина;
        
    КонецЦикла;
    
    Для Каждого Строка Из ТаблицаЗначений Цикл
    	
        НоваяСтрока = Новый Структура(СтруктураСтрокой);
        ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
        Массив.Добавить(НоваяСтрока);
        
    КонецЦикла;
    
    Возврат Массив;

КонецФункции

Процедура ЗаполнитьРеализацииНаСервере() 
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	ДоговорыКонтрагентов.Ссылка КАК Договор,
        |	РеализацияТоваровУслуг.Ссылка КАК Реализация
        |ИЗ
        |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
        |		ПО РеализацияТоваровУслуг.Договор = ДоговорыКонтрагентов.Ссылка
        |ГДЕ
        |	НЕ ДоговорыКонтрагентов.ПометкаУдаления
        |	И РеализацияТоваровУслуг.Дата = &Дата
        |	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание)";
    
    Запрос.УстановитьПараметр("Дата", Объект.ВКМ_Период); 
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Выборка = РезультатЗапроса.Выбрать();      
    
    Пока Выборка.Следующий() Цикл
    	
        НоваяСтрока = Объект.СписокДоговоров.Добавить();
        НоваяСтрока.Договор = Выборка.Договор; 
        НоваяСтрока.Реализация = Выборка.Реализация;
        
    КонецЦикла;
        
КонецПроцедуры

#КонецОбласти

