
#Область ОбработчикиКомандФормы

&НаСервере
Процедура ПолучитьДоговорыНаСервере()      
	
	Объект.СписокДоговоров.Очистить();	
	
	ДоговорыКонтрагентов = ПолучитьДоговорыКонтрагентов(Объект.ВКМ_Период);
	
	Для Каждого Строка Из ДоговорыКонтрагентов Цикл
		
		Если ДоговорыКонтрагентов.Количество() > 0 Тогда  
			
			НоваяСтрока = Объект.СписокДоговоров.Добавить(); 
			НоваяСтрока.Договор = Строка.Договор;
			НоваяСтрока.Клиент = Строка.Клиент;
			
		КонецЕсли;	
		
	КонецЦикла;   
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДоговоры(Команда)
	ПолучитьДоговорыНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьДоговорыКонтрагентов(Период)
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	ДоговорыКонтрагентов.Ссылка КАК Договор,
        |	Контрагенты.Ссылка КАК Клиент
        |ИЗ
        |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
        |		ПО ДоговорыКонтрагентов.Владелец = Контрагенты.Ссылка
        |ГДЕ
        |	НЕ ДоговорыКонтрагентов.ПометкаУдаления
        |	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание)
        |	И (ДоговорыКонтрагентов.ВКМ_ДатаНачалаДоговора < &Период
        |			ИЛИ ДоговорыКонтрагентов.ВКМ_ДатаНачалаДоговора = &Период)
        |	И (ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДоговора > &Период
        |			ИЛИ ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДоговора = &Период)";  
	
	Запрос.УстановитьПараметр("Период", Период);          
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Выборка = РезультатЗапроса.Выбрать();  
	
    МассивДоговоров = Новый Массив;  
	    
	Пока Выборка.Следующий() Цикл  
		
		СтруктураДоговоров = Новый Структура;   
		
		СтруктураДоговоров.Вставить("Договор", Выборка.Договор); 
		СтруктураДоговоров.Вставить("Клиент", Выборка.Клиент); 
		
		МассивДоговоров.Добавить(СтруктураДоговоров);  
		 
	КонецЦикла;      	     
		
    Возврат МассивДоговоров;     
    
КонецФункции  

&НаСервере
Функция ВыполнитьДлительнуюОперациюНаСервере(СписокДоговоров, ВыбранныйПериод)
		
	СоздатьРеализацииНаСервере = ДлительныеОперации.ВыполнитьФункцию(ЭтаФорма.УникальныйИдентификатор, "Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьРеализацииНаСервере", СписокДоговоров, ВыбранныйПериод);
	
	Возврат СоздатьРеализацииНаСервере;
	
КонецФункции 

&НаКлиенте
Процедура ВКМ_СоздатьДокументы(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ВКМ_Период) Тогда 
	    Сообщить("Не заполнен период"); 
	    Возврат; 
	КонецЕсли; 
	
	СписокДоговоров = ПолучитьДанныеДоговоров();
    ВыбранныйПериод = Объект.ВКМ_Период; 
	
	ЕстьРеализации = ПроверитьРеализациюНаПериод(ВыбранныйПериод);   
	
	 Если ЕстьРеализации Тогда
        Сообщить("Уже созданы реализации за этот период"); 
        Возврат;     
    КонецЕсли; 
		
	ДлительнаяОперация = ВыполнитьДлительнуюОперациюНаСервере(СписокДоговоров, ВыбранныйПериод);  
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма);
	ПараметрыОжидания.Интервал = 1;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	
	ОповещаниеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещаниеОЗавершении,ПараметрыОжидания);
	
КонецПроцедуры   

&НаСервере
Функция ПолучитьДанныеДоговоров() Экспорт
	
   СписокДоговоров = Объект.СписокДоговоров.Выгрузить().ВыгрузитьКолонку("Договор");
	
   Возврат СписокДоговоров;	
	
КонецФункции

&НаСервере
Процедура ОповещениеОЗавершении(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Статус = "Выполнено" Тогда
		ОбщегоНазначения.СообщитьПользователю("Результат длительной операции: " + ПолучитьИзВременногоХранилища(Результат.АдресРезультата));
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьРеализациюНаПериод(Период) 
        
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |    РеализацияТоваровУслуг.Ссылка КАК Ссылка
        |ИЗ
        |    Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
        |ГДЕ
        |    НЕ РеализацияТоваровУслуг.ПометкаУдаления
        |    И РеализацияТоваровУслуг.Дата = &Дата";
    
    Запрос.УстановитьПараметр("Дата", Период);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Выборка = РезультатЗапроса.Выбрать();
    
    Если Выборка.Следующий() Тогда
        Возврат Истина; 
    Иначе 
        Возврат Ложь; 
    КонецЕсли;
        
КонецФункции 

#КонецОбласти

