
#Область СлужебныеПроцедурыИФункции

Процедура ВыполнитьАвтозаполнение(Товары, Услуги, Договор, Дата, Ссылка) Экспорт
		
		ВКМ_НоменклатураАбонентскаяПлатаЗначение  = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
		ВКМ_НоменклатураРаботыСпециалистаЗначение = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
				
		Если ВКМ_НоменклатураАбонентскаяПлатаЗначение = "" ИЛИ ВКМ_НоменклатураРаботыСпециалистаЗначение = "" Тогда
			Возврат
		КонецЕсли;	
		
		Товары.Очистить();
		Услуги.Очистить();
		
		Если Договор.ВКМ_СуммаАбонентскойПлаты = 0 Тогда
			Возврат;
		КонецЕсли;
		
		НоваяСтрокаТЧТовары = Товары.Добавить(); 
		НоваяСтрокаТЧТовары.Номенклатура = ВКМ_НоменклатураАбонентскаяПлатаЗначение;
		НоваяСтрокаТЧТовары.Количество = 1;
		НоваяСтрокаТЧТовары.Сумма = Договор.ВКМ_СуммаАбонентскойПлаты;
		НоваяСтрокаТЧТовары.Цена = Договор.ВКМ_СуммаАбонентскойПлаты;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ВКМ_ВыполненныеКлиентуРаботыОбороты.ВКМ_КоличествоЧасовОборот КАК ВКМ_КоличествоЧасовОборот,
			|	ВКМ_ВыполненныеКлиентуРаботыОбороты.ВКМ_СуммаКОплатеОборот КАК ВКМ_СуммаКОплатеОборот
			|ИЗ
			|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(&НачалоМесяца, &КонецМесяца, Период, ВКМ_Договор.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание)) КАК ВКМ_ВыполненныеКлиентуРаботыОбороты
			|		ПО РеализацияТоваровУслуг.Контрагент = ВКМ_ВыполненныеКлиентуРаботыОбороты.ВКМ_Клиент
			|			И РеализацияТоваровУслуг.Договор = ВКМ_ВыполненныеКлиентуРаботыОбороты.ВКМ_Договор
			|ГДЕ
			|	РеализацияТоваровУслуг.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Дата));
		Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Дата));
		
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НоваяСтрокаТЧУслуги = Услуги.Добавить();
		    НоваяСтрокаТЧУслуги.Номенклатура = ВКМ_НоменклатураРаботыСпециалистаЗначение;
		    НоваяСтрокаТЧУслуги.Количество = ВыборкаДетальныеЗаписи.ВКМ_КоличествоЧасовОборот;
		    НоваяСтрокаТЧУслуги.Сумма = ВыборкаДетальныеЗаписи.ВКМ_СуммаКОплатеОборот;
		    НоваяСтрокаТЧУслуги.Цена = ВыборкаДетальныеЗаписи.ВКМ_СуммаКОплатеОборот/ВыборкаДетальныеЗаписи.ВКМ_КоличествоЧасовОборот;
		
		КонецЦикла;
		
КонецПроцедуры

#КонецОбласти